starting_select_lang = """
🌟 سلام دوست عزیز! خیلی خوش آمدید! 🌟

برای ادامه، لطفاً ابتدا زبان مورد نظر خود را انتخاب کنید.
"""

greeting = """
👋 سلام دوست عزیز! خیلی خوش آمدید! 👋

شما می‌توانید در هر زمان، لینک ویدیویی که می‌خواهید دانلود کنید، ارسال کنید.
"""

restart_required = "لطفا با دستور /start ربات را مجددا راه‌اندازی کنید."

change_language = "لطفاً زبان مورد نظر خود را انتخاب کنید."

language_changed = """
تغییر زبان با موفقیت انجام شد! 🎉
با استفاده از دکمه های زیر از ربات استفاده کنید.
"""

unknown_request = "ببخشید، من درخواست شما را متوجه نشدم. 🧐"

guide = """
         نحوه استفاده از *DiTube*:
1. لینک ویدیو را ارسال کنید.
2. روش دانلود را انتخاب کنید.
3. از ویدیوی دانلود شده خود لذت ببرید!
    
🌐 *@DiarDev*
🤖 *@DiTubebot*"""

donate = "شما می‌توانید با استفاده از یکی از روش های زیر، از توسعه‌دهنده حمایت کنید. 😊\n\nراهنما : \nکافیته برای حمایت ریالی\n ترون برای حمایت با ارز دیجیتال\n\nCoffeete : https://www.coffeete.ir/DiarTor\nTron (TRX) : `TJXeM5puLgWu8sHu96riZrrpxLxanvUB59`"

select_download_option = "❓لطفا کیفیت را انتخاب کنید:"

problem_from_server = "❌خطایی از سمت سرور رخ داده است! لطفاً دوباره امتحان کنید."

getting_media_link_information = "🔍درحال دریافت اطلاعات لینک..."

age_restricted_exception = "متأسفیم، محتوایی که می‌خواهید دانلود کنید دارای محدودیت سنی توسط یوتیوب است، بنابراین ما قادر به دانلود آن نیستیم. 🧐"

subscribe_to_channel = """✨ برای استفاده از ربات، لطفاً ابتدا با فشردن دکمه زیر در کانال ما عضو شوید.

🚀 پس از عضویت، لطفاً دکمه "عضو شدم" را فشار داده و ربات را راه اندازی کنید."""

returned_to_homepage = "شما به صفحه اصلی برگشتید. 🏡"

send_the_giftcode = "لطفا کد هدیه را ارسال کنید"

reciving_message_from_support = "پیام پشتیبانی:"

your_message_was_sent_to_support = "پیام شما به پشتیبانی ارسال شد."

youre_connected_to_support = "شما اکنون به بخش پشتیبانی متصل هستید، لطفا پیام خود را ارسال کنید."

account_details = ("""
👤 **اطلاعات حساب**
👥 شناسه کاربری: `{}`
🌍 زبان: فارسی 🇮🇷
📅 تاریخ عضویت: {}

📥 تعداد کل دانلودها: {}
💾 حجم کل دانلودها: {} مگابایت

💰 موجودی: {} تومان
🤝 تعداد زیر مجموعه ها: {}

🚀 برای شارژ حساب کاربری خود از دکمه '*'شارژ حساب'*' استفاده کنید، و برای زیر مجموعه گیری از دکمه '*'زیر مجموعه گیری'*' استفاده کنید!

@DiTubebot
""")


subscription_details = ("""🔸 نوع : {}
🟢 وضعیت : {}
💲 قیمت : {}
📅 تاریخ شروع : {}
❌ تاریخ انقضا : {}
📏 حداکثر حجم برای هر فایل : {} مگابایت
📆 حداکثر حجم در روز : {} مگابایت
💾 حجم استفاده شده : {} مگابایت
💼 حجم باقی‌مانده : {} مگابایت
➖➖➖➖➖➖➖➖➖➖➖

✨در صورتی که تمایل دارید پس از تمام شدن زمان اشتراک، اشتراک شما با 10 درصد تخفیف بصورت خودکار تمدید شود، گزینه تمدید خودکار را فعال کنید.

@DiTubebot""")

joined_in_settings = "لطفا از دکمه های زیر استفاده کنید."

redeem_successful = """کد هدیه با موفقیت اعمال شد.
موجودی جدید شما *{}* تومان است.
"""
code_already_redeemed = "این کد هدیه قبلاً استفاده شده است."

invalid_giftcode = "کد هدیه معتبر نیست."