select_lang = """
🌟 سلام دوست عزیز! خیلی خوش آمدید! 🌟

برای ادامه، لطفاً ابتدا زبان مورد نظر خود را انتخاب کنید.
"""

greeting = """
👋 سلام دوست عزیز! خیلی خوش آمدید! 👋

شما می‌توانید در هر زمان، لینک ویدیویی که می‌خواهید دانلود کنید، ارسال کنید.
"""

restart = "لطفا با دستور /start ربات را مجددا راه‌اندازی کنید."

change_lang = "لطفاً زبان مورد نظر خود را انتخاب کنید."

lang_changed = """
تغییر زبان با موفقیت انجام شد! 🎉
حالا شما می‌توانید از ربات استفاده کنید.
برای مشاهده دستورات, از دستور /help استفاده کنید.
"""

didnt_understand = "ببخشید، من درخواست شما را متوجه نشدم. 🧐"

guide = """
📚 راهنما:

برای دانلود ویدیوها از یوتیوب، به راحتی می‌توانید هر زمان لینک ویدیو را ارسال کنید.

دستورات ربات:
/start - راه‌اندازی مجدد ربات
/lang - تغییر زبان
/donate - حمایت از توسعه‌دهنده
"""

donate = "شما می‌توانید با استفاده از یکی از روش های زیر، از توسعه‌دهنده حمایت کنید. 😊\n\nراهنما : \nکافیته برای حمایت ریالی\n ترون برای حمایت با ارز دیجیتال\n\nCoffeete : https://www.coffeete.ir/DiarTor\nTron (TRX) : `TJXeM5puLgWu8sHu96riZrrpxLxanvUB59`"

select_quality = "❓لطفا یکی از دکمه های زیر را انتخاب کنید:"

timed_out = "❌خطایی از سمت سرور رخ داده است!"

get_video_info = "🔍درحال دریافت اطلاعات ویدیو..."

age_restricted = "متأسفیم، ویدیویی که می‌خواهید دانلود کنید دارای محدودیت سنی توسط یوتیوب است، بنابراین ما قادر به دانلود آن نیستیم. 🧐"
send_user_id_usage = "استفاده: /send <شناسه_کاربر>"
user_not_found = "کاربری یافت نشد ❌"
please_send_message = "لطفاً پیامی که می‌خواهید ارسال کنید را ارسال کنید"
message_sent_to_all = "پیام شما به تمام کاربران ارسال شد ✅"
message_sent_to_user = "پیام شما به کاربر ارسال شد ✅"
user_not_specified = "کاربر مشخص نشده است. لطفاً ابتدا از دستور /send <شناسه_کاربر> استفاده کنید."
sending_to_all_prompt = "لطفاً پیام خود را به تمام کاربران ارسال کنید"