select_lang = """
🌟 سلام دوست عزیز! خیلی خوش آمدید! 🌟

برای ادامه، لطفاً ابتدا زبان مورد نظر خود را انتخاب کنید.
"""

greeting = """
👋 سلام دوست عزیز! خیلی خوش آمدید! 👋

شما می‌توانید در هر زمان، لینک ویدیویی که می‌خواهید دانلود کنید، ارسال کنید.
"""

restart = "لطفا با دستور /start ربات را مجددا راه‌اندازی کنید."

change_lang = "لطفاً زبان مورد نظر خود را انتخاب کنید."

lang_changed = """
تغییر زبان با موفقیت انجام شد! 🎉
حالا شما می‌توانید از ربات استفاده کنید.
برای مشاهده دستورات, از دستور /help استفاده کنید.
"""

didnt_understand = "ببخشید، من درخواست شما را متوجه نشدم. 🧐"

guide = """
📚 راهنما:

برای دانلود ویدیوها از یوتیوب، به راحتی می‌توانید هر زمان لینک ویدیو را ارسال کنید.

دستورات ربات:
/start - راه‌اندازی مجدد ربات
/lang - تغییر زبان
/donate - حمایت از توسعه‌دهنده
"""

donate = "شما می‌توانید با استفاده از یکی از روش های زیر، از توسعه‌دهنده حمایت کنید. 😊\n\nراهنما : \nکافیته برای حمایت ریالی\n ترون برای حمایت با ارز دیجیتال\n\nCoffeete : https://www.coffeete.ir/DiarTor\nTron (TRX) : `TJXeM5puLgWu8sHu96riZrrpxLxanvUB59`"

select_quality = "❓لطفا کیفیت را انتخاب کنید:"

timed_out = "❌خطایی از سمت سرور رخ داده است!"

get_video_info = "🔍درحال دریافت اطلاعات ویدیو..."