select_lang = """سلام دوست عزیز خیلی خوش اومدید! 😀
جهت ادامه لطفا اول زبان را انتخاب کنید."""
greeting = """سلام دوست عزیز خیلی خوش اومدید! 😀
شما می توانید لینک ویدیویی که می خواهید دانلود کنید را در هر زمان ارسال کنید."""
restart = "لطفا با دستور /start ربات را مجددا راه اندازی کنید!"
change_lang = "لطفا زبان مورد نظر خود را انتخاب کنید."
lang_changed = "زبان شما با موفقیت تغییر کرد! حالا میتوانید از ربات استفاده کنید.\n جهت دیدن راهنما از /help استفاده کنید."
didnt_understand = "ببخشید ولی منظورتان را متوجه نشدم🧐"
guide = """برای دانلود ویدیو از یوتیوب می توانید لینک ویدیو را در هر زمانی ارسال کنید

دستورات ربات:
/start - راه اندازی مجدد ربات
/lang - تغییر زبان ربات
/donate - حمایت مالی از سازنده ربات"""